6HJS/CC2640R2F_BLE5/source/ti/ble5stack/microstack/RFCC26XX_singleMode_2_20.c
// Update implicit state based on finished commands
static void updateImplicitState(RF_Cmd* pCmd)
{
    uint8_t nCmdChainMax = RF_MAX_CHAIN_CMD_LEN;

    // Looks at operation or chained operations in a command and:
    // - Makes a copy of any FS operation for a future power up sequence
    RF_Op* pOp = pCmd->pOp;
    while (pOp && nCmdChainMax)
    {
        if ((pOp->commandNo == CMD_FS) || (pOp->commandNo == CMD_FS_OFF))
        {
            // Create a copy of CMD_FS command (or CMD_FS_OFF) for later power up
            memcpy(&pCmd->pClient->state.mode_state.cmdFs, pOp, sizeof(pCmd->pClient->state.mode_state.cmdFs));
            break;
        }
        pOp = pOp->pNextOp;
        --nCmdChainMax;
    }
}

// The RF_HW ISR when radio is active.
static void hwiFxnHw(xdc_UArg a)
{
    RF_CmdDirImm* pDirImmCmd = &cmdDirImm;

    uint32_t rfchwifg = (HWREG(RFC_DBELL_BASE + RFC_DBELL_O_RFHWIFG) & (RF_INTERNAL_HW_IFG_MASK_32_BIT | RF_HW_INT_RAT_CH_MASK));
    HWREG(RFC_DBELL_BASE + RFC_DBELL_O_RFHWIFG) = ~rfchwifg;

    // Post SWI to handle registered callbacks
    if ((rfchwifg & RF_INTERNAL_HW_IFG_MASK_32_BIT) &&
        (HWREG(RFC_DBELL_BASE + RFC_DBELL_O_RFHWIEN) & RF_INTERNAL_HW_IFG_MASK_32_BIT))
    {
        Swi_or(Swi_handle(&swiFsm), Fsm_EventHwInt);
    }

    if (rfchwifg & RF_HW_INT_RAT_CH_MASK)
    {
        pDirImmCmd->hwIntEvent |= (rfchwifg & RF_HW_INT_RAT_CH_MASK);
        Swi_or(Swi_handle(&swiHw), 0);
    }
}

// SWI used for user callback to any RAT event (RF_HW HWI)
static void swiFxnHw(xdc_UArg a, xdc_UArg b)
{
    RF_CmdDirImm* pDirImmCmd = &cmdDirImm;

    // RAT channel callback
    // Optimize code to issue callback in the order in which the RAT ch int was received
    uint32_t key = Hwi_disable();
    if (pDirImmCmd->hwIntEvent & RF_HW_INT_RAT_CH_MASK)
    {
        uint8_t ratCbIdx = pDirImmCmd->hwIntEvent >> RFC_DBELL_RFHWIFG_RATCH5_BITN;
        // Process lower channel first and allow multiple interrupt flags to be processed sequentially
        if (ratCbIdx & (1 << RF_RAT_CH_5_INDEX))
        {
            ratCbIdx = RF_RAT_CH_5_INDEX;
        }
        else if (ratCbIdx & (1 << RF_RAT_CH_6_INDEX))
        {
            ratCbIdx = RF_RAT_CH_6_INDEX;
        }
        else if (ratCbIdx & (1 << RF_RAT_CH_7_INDEX))
        {
            ratCbIdx = RF_RAT_CH_7_INDEX;
        }

        ratChanFree(ratCbIdx + RF_RAT_CH_OFFSET);
        pDirImmCmd->hwIntEvent &= ~(1 << (ratCbIdx + RFC_DBELL_RFHWIFG_RATCH5_BITN));
        Hwi_restore(key);
        if (pDirImmCmd->pRatCb[ratCbIdx])
        {
            pDirImmCmd->pRatCb[ratCbIdx](pDirImmCmd->pClient, ratCbIdx + RF_RAT_CH_OFFSET, RF_EventRatCh);
        }
    }
    else
    {
        Hwi_restore(key);
    }

    // Process if multiple interrupt flag bits are set
    if (pDirImmCmd->hwIntEvent)
    {
        Swi_or(Swi_handle(&swiHw), 0);
    }

    // Handle error event callback
    if (pDirImmCmd->flags & RF_RAT_ERR_CB_EVENT_FLAG)
    {
        if (pDirImmCmd->pWakeUpErrCb)
        {
            pDirImmCmd->pWakeUpErrCb(pDirImmCmd->pClient, RF_ALLOC_ERROR, RF_EventCmdError);
        }
        pDirImmCmd->flags &= ~RF_RAT_ERR_CB_EVENT_FLAG;
    }

}

// The CPE0 ISR when radio is active. Assume that all IRQs relevant to command
// dispatcher are mapped here. Furthermore, assume that there is no need for
// critical sections here (i.e. that this ISR has higher priority than
// any HWI calling a RF API function or that HWIs can't call the RF API)
static void hwiFxnCpe0Active(xdc_UArg a)
{
    RF_Cmd* pCmd;

    // Get and clear doorbell IRQs
    uint32_t rfcpeifg = RFCCpeIntGetAndClear();

    // Retire command that has run
    if (rfcpeifg & RFC_DBELL_RFCPEIFG_LAST_COMMAND_DONE_M)
    {
        // LAST_COMMAND_DONE received.
        if ((pCmd = cmdQ.pCurrCmd))
        {
            // No longer current command
            cmdQ.pCurrCmd = NULL;

            // Save CPEIFG for callback
            pCmd->rfifg |= ((rfcpeifg & pCmd->bmEvent) | RF_EventLastCmdDone);

            // Move current command to done queue
            HWREG(RFC_DBELL_BASE + RFC_DBELL_O_RFCPEIEN) &= ~(pCmd->bmEvent & RF_INTERNAL_CPE_IFG_MASK_32_BIT);
            HWREG(RFC_DBELL_BASE + RFC_DBELL_O_RFHWIEN) &= ~(pCmd->bmEvent >> RF_SHIFT_32_BITS);
            Q_push(&cmdQ.pDone, pCmd);

            // Post SWI to handle registered callbacks and potentially start inactivity timer
            Swi_or(Swi_handle(&swiFsm), Fsm_EventLastCommandDone);
        }
    }

    // Handle additional interrupts here?
    pCmd = cmdQ.pCurrCmd;
    if ((!(rfcpeifg & Fsm_EventLastCommandDone)) && (rfcpeifg & (pCmd->bmEvent)))
    {
        cmdQ.pCurrCmdCb = pCmd;

        // Save CPEIFG for callback
        pCmd->rfifg |= (rfcpeifg & pCmd->bmEvent);

        // Post SWI to handle registered callbacks
        Swi_or(Swi_handle(&swiFsm), Fsm_EventCpeInt);
    }

    // Dispatch pending command
    if ((!cmdQ.pCurrCmd) && (pCmd = Q_peek(&cmdQ.pPend)))
    {
        if (pCmd->pClient != pCurrClient)
        {
            // We need to change radio client, signal to FSM. Once radio client has
            // changed (either as part of power-up or PHY change) the FSM will invoke
            // this ISR and dispatch command (Unsupported feature)
            Swi_or(Swi_handle(&swiFsm), Fsm_EventChangePhy);
        }
        else if ((dispatchInUs = dispatchOpWhen(pCmd->pOp)))
        {
            // Command sufficiently far into future that it shouldn't be dispatched yet
            // Decrement active client count and potentially power down radio
            decActiveClientCnt(dispatchInUs);
        }
        else
        {
            HWREG(RFC_DBELL_BASE + RFC_DBELL_O_RFCPEIEN) |= (pCmd->bmEvent & RF_INTERNAL_CPE_IFG_MASK_32_BIT);
            HWREG(RFC_DBELL_BASE + RFC_DBELL_O_RFHWIEN) |= (pCmd->bmEvent >> RF_SHIFT_32_BITS);

            // Dispatch immediately, set command to current and remove from pending queue
            HWREG(RFC_DBELL_BASE + RFC_DBELL_O_RFACKIFG) = 0;
            HWREG(RFC_DBELL_BASE+RFC_DBELL_O_CMDR) = (uint32_t)pCmd->pOp;
            while(!HWREG(RFC_DBELL_BASE + RFC_DBELL_O_RFACKIFG));

            Q_pop(&cmdQ.pPend);
            cmdQ.pCurrCmd = pCmd;
        }
    }
}


/* Clock callback due to inactivity timeout OR next pending command far into future */
static void clkInactivityFxn(RF_Object* pObj)
{
    // Decrement active client count and potentially signal to FSM that we can
    // power down radio
    decActiveClientCnt(0);
}


/* Callback used to post semaphore for runCmd() and waitCmd() */
static void syncCb(RF_Handle h, RF_CmdHandle ch, RF_EventMask e)
{
    if (h->state.pCbSync != NULL)
    {
        ((RF_Callback)h->state.pCbSync)(h, ch, e);
    }

