6HJS/CC2640R2F_BLE5/source/ti/ble5stack/microstack/RFCC26XX_singleMode_2_20.c
            // add margin to the power up duration to account for the TIRTOS/Drivers overhead
            pObj->clientConfig.nPowerUpDuration += RF_DEFAULT_POWER_UP_MARGIN;

            // power up duration should be within certain upper and lower bounds
            if ((pObj->clientConfig.nPowerUpDuration > RF_DEFAULT_POWER_UP_TIME) ||
                (pObj->clientConfig.nPowerUpDuration < RF_DEFAULT_MIN_POWER_UP_TIME))
            {
                pObj->clientConfig.nPowerUpDuration = RF_DEFAULT_POWER_UP_TIME;
            }
        }

        // reset nRtc1
        nRtc1 = 0;

        // Check the status of the CMD_FS, if it was sent (chained) to the setup command sent
        // during Fsm_EventChangePhy1 and return error callback to the client
        // client can either resend the CMD_FS or ignore the error as per Errata on PG2.1
        if (pObj->clientConfig.pErrCb)
        {
            if ((opRatSync.start.condition.rule == COND_ALWAYS) &&
                (pObj->state.mode_state.cmdFs.status == ERROR_SYNTH_PROG))
            {
                RF_Callback pErrCb = (RF_Callback)pObj->clientConfig.pErrCb;
                pErrCb(pObj, RF_ERROR_CMDFS_SYNTH_PROG, RF_EventError);
            }
        }

        // Change HWI handler
        Hwi_setFunc(Hwi_handle(&hwiCpe0), hwiFxnCpe0Active, (UArg)NULL);

        // Get the available RAT channel map
        if (bInitAvailRatCh)
        {
            rfc_CMD_GET_FW_INFO_t getFwInfoCmd;
            getFwInfoCmd.commandNo = CMD_GET_FW_INFO;
            RFCDoorbellSendTo((uint32_t)&getFwInfoCmd);
            pCmdDirImm->availRatCh = getFwInfoCmd.availRatCh;
            bInitAvailRatCh = false;
        }

        // Mark radio and client as being active
        bRadioActive = true;
        nActiveClients++;
        bPowerUpActive = false;

        // Make sure pending command gets issued by issuing CPE0 IRQ
        Hwi_post(INT_RFC_CPE_0);

        // Power up callback
        if (pObj->clientConfig.pPowerCb)
        {
            RF_Callback pPowerCb = (RF_Callback)pObj->clientConfig.pPowerCb;
            pPowerCb(pObj, 0, RF_EventPowerUp);
        }

        // We've handled this event now
        e &= ~Fsm_EventPowerStep;
    }
    else if (bYieldPwrDnCancel && (e & Fsm_EventPowerDown))
    {
        bYieldPwrDnCancel = false;
        e &= ~Fsm_EventPowerDown;
    }
    else if (e & Fsm_EventPowerDown)
    {
        // Powerdown RF core
        // The proper thing to do here is to avoid switching off the digital part of
        // radio without switching off the analog parts first

        // Radio not active
        bRadioActive = false;
        bPowerDownActive = true;

        // set VCOLDO reference
        RFCAdi3VcoLdoVoltageMode(false);

        // Next state: fsmPowerDown2State
        FsmNextState(&fsmPowerDownState);

        // Remap HWI to startup function
        Hwi_setFunc(Hwi_handle(&hwiCpe0), hwiFxnCpe0PowerFsm, (UArg)NULL);

        if ((bStart == 0) || (bInitAvailRatCh))
        {
            bStart = 1;

            // Always do RAT_SYNC_STOP command the first time power down
            opRatSync.stop.commandNo                = CMD_SYNC_STOP_RAT;
            opRatSync.stop.condition.rule           = COND_NEVER;
            opRatSync.stop.status                   = IDLE;
            opRatSync.stop.startTrigger.triggerType = TRIG_NOW;
            opRatSync.stop.pNextOp                  = NULL;
            HWREG(RFC_DBELL_BASE+RFC_DBELL_O_CMDR)  = (uint32_t)&opRatSync.stop;
        }
        else if (dispatchInUs)
        {
            // Time in active state measured
            nRtc3 = AONRTCCurrent64BitValueGet();
            nRtc3 = (nRtc3-nRtc1) >> RF_RTC_CONV_TO_US_SHIFT;
            activeTimeInUs += nRtc3;
            if (activeTimeInUs < (dispatchInUs << RF_SEND_RAT_STOP_RATIO))
            {
                Swi_or(Swi_handle(&swiFsm), Fsm_EventPowerStep);
            }
            else
            {
                // Reset active time accumulation
                activeTimeInUs = 0;

                // Setup RAT_SYNC command to follow FsPowerdown command
                opRatSync.stop.commandNo                = CMD_SYNC_STOP_RAT;
                opRatSync.stop.condition.rule           = COND_NEVER;
                opRatSync.stop.status                   = IDLE;
                opRatSync.stop.startTrigger.triggerType = TRIG_NOW;
                opRatSync.stop.pNextOp                  = NULL;
                HWREG(RFC_DBELL_BASE+RFC_DBELL_O_CMDR) = (uint32_t)&opRatSync.stop;
            }
        }
        else
        {
            Swi_or(Swi_handle(&swiFsm), Fsm_EventPowerStep);
        }

        // We've handled this event now
        e &= ~Fsm_EventPowerDown;
    }
    else if (e & Fsm_EventHwInt)
    {
        pCmd = Q_peek(&cmdQ.pCurrCmd);
        if (pCmd && pCmd->pCb)
        {
            pCmd->pCb(pCmd->pClient, pCmd->ch, RF_EventMdmSoft);
        }
        // We've handled this event now
        e &= ~Fsm_EventHwInt;
    }
    else
    {
        // No other FSM event has any effect
    }

    // Call self again if there are outstanding events to be processed
    if (e)
    {
        Swi_or(Swi_handle(&swiFsm), e);
    }
}

static void fsmPowerDownState(RF_Object *pObj, Fsm_Event e)
{
    if (e&Fsm_EventPowerStep)
    {
        // Turn off Synth
        RFCSynthPowerDown();

        // Next state: fsmPowerUpState
        FsmNextState(&fsmPowerUpState);

        // Closing all handles
        if (!bInitialized)
        {
            Semaphore_post(Semaphore_handle(&pObj->state.semSync));
        }

        // Turn off CPE
        RFCClockDisable();

        // Release constraints and dependencies, turning off RF core
        Power_releaseConstraint(PowerCC26XX_SB_DISALLOW);
        Power_releaseDependency(PowerCC26XX_DOMAIN_RFCORE);
        if(pObj->clientConfig.bPowerUpXOSC == false)
        {
            Power_releaseDependency(PowerCC26XX_XOSC_HF);
        }

        // Radio powered down
        bPowerDownActive = false;
        bYieldPwrDnCalled = false;

        // Start radio if required
        if (bRestart)
        {
            bRestart = false;
            Swi_or(Swi_handle(&swiFsm), Fsm_EventWakeup);
        }
    }
}



/*-------------- Initialization & helper functions ---------------*/

/* Initialize RF driver.  */
static void rf_init()
{
    union {
        Hwi_Params hp;
        Swi_Params sp;
    } params;

    //Power init
    Power_init();

    // Enable output RTC clock for Radio Timer Synchronization
    HWREG(AON_RTC_BASE + AON_RTC_O_CTL) |= AON_RTC_CTL_RTC_UPD_EN_M;

    // Initialize SWIs and HWIs
    Swi_Params_init(&params.sp);
    params.sp.priority = RFCC26XX_hwAttrs.swiCpe0Priority;
    Swi_construct(&swiFsm, swiFxnFsm, &params.sp, NULL);

    Hwi_Params_init(&params.hp);
    params.hp.enableInt = false;
    params.hp.priority = RFCC26XX_hwAttrs.hwiCpe0Priority;
    Hwi_construct(&hwiCpe0, INT_RFC_CPE_0, hwiFxnCpe0PowerFsm, &params.hp, NULL);

    Swi_Params_init(&params.sp);
    params.sp.priority = RFCC26XX_hwAttrs.swiHwPriority;
    Swi_construct(&swiHw, swiFxnHw, &params.sp, NULL);

    Hwi_Params_init(&params.hp);
    params.hp.enableInt = true;
    params.hp.priority = RFCC26XX_hwAttrs.hwiHwPriority;
    Hwi_construct(&hwiHw, INT_RFC_HW_COMB, hwiFxnHw, &params.hp, NULL);

